<template>
    <div class="Franshisa">
       <div class="menu">
        <Menu/>
       </div>
       <div class="content py-5">
          <About :aboutInfo="aboutInfo">
             <template v-slot:infoText>
                <div class="infoText xx:w-11/12 xl:w-7/12 md:w-7/12">
                    <h1 class="font-bold text-xl font-sans">{{aboutInfo.info_title}}</h1>
                    <p class="py-10 text-sm">{{aboutInfo.info_text}}</p>
                </div>
             </template>
             <template v-slot:footers>
                <div class="infoText xx:w-11/12 xl:w-7/12 md:w-7/12">
                    <div 
                        class="items py-5" 
                        v-for="(item,index) in aboutInfo.footers" 
                        :key="index">
                        <h1 class="font-bold text-xl font-sans">{{item.title}}</h1>
                        <ol class="py-5"
                        :class="[index % 2 != 0 ? 'list-disc list-inside' : '']">
                          <li
                            class="text-sm"
                            v-for="(x,index) in item.text"
                            :key="index"
                            >
                             {{x}}
                          </li>
                        </ol>
                    </div>
                </div>
             </template>
          </About>
       </div>
       <div class="footer bg-zinc-900 h-89 flex flex-col justify-center">
           <Footer />
       </div>
    </div>
</template>

<script setup>
import Menu from "@/components/MenuBar.vue"
import Footer from "@/components/footer.vue"
import About from "@/components/about.vue"
import {ref,onMounted} from "vue"
const number = ref({
    num: 1,
    style: "w-1/2 h-1/2 block object-cover"
})
const aboutInfo = ref({
   title: "Франшиза",
   info_title: "Многолетний успешный опыт ведения бизнеса",
   info_text: "Мы работаем с 1998 года в сфере розничной и оптовой торговли автомобильными шинами и дисками, и на сегодняшний день являемся одним из крупнейших игроков рынка, а также официальным дилером большинства известных мировых производителей.Собственная филиальная сеть компании работает в Новосибирске, Барнауле, Томске, Кемерово, Новокузнецке, Прокопьевске, Камне-на-Оби, Ленинске-Кузнецком, Бийске, Красноярске, Абакане.",
   text: "Компания «Сибирь Колесо» предлагает Вам начать собственный успешный бизнес по модели франчайзинга. Мы поможем Вам открыть магазин «под ключ», обеспечим Вас входящим онлайн трафиком покупателей на сайт, передадим все наработанные за много лет технологии ведения прибыльного бизнеса и обеспечим постоянной поддержкой профессионалов",
   disks:[
    {title: "Прочные позиции на рынке", text: "Широкий ассортимент: более 40 000 позиций. Одни из самых выгодных цен на рынке. Известный бренд, масштабные рекламные компании и первые строчки в поисковиках. Раскрученный с 2010 года сайт с удобным подбором шин (от 5 000 до 15 000 посетителей в день). Наличие товара: большой ассортимент всегда в наличии, а также возможность купить эксклюзивные позиции под заказ."},
    {title: "Быстрый старт", text: "Открытие и оборудование фирменного магазина-склада «под ключ». Настройка всех IT-систем «под ключ» (сайт, система приема заявок, 1С и т.д.). Формирование начального склада опытными профессионалами. Подготовка и реализация рекламной кампании в интернет за свой счет для создания постоянного входящего трафика покупателей. Очное предстартовое обучение персонала всем технологиям ведения бизнеса."}
   ],
   footer_text: "",
   footers: [
      {
        title: "Выгодные условия франшизы",
        text: ['Договор на 3 года с приоритетом при продлении. Низкий паушальный взнос – от 100 000 рублей. Отсутствие роялти. Доступный объем инвестиций – от 1 миллиона рублей. Выход на безубыточность через 2-4 месяца в зависимости от сезонности. Эксклюзив на территорию – все продажи на оговоренной территории идут в зачет франчайзи. Обеспеченность онлайн-продажами через сайт, готовый трафик покупателей (реклама и продвижение сайта за счет франчайзора). Единый склад по всей сети филиалов и франчайзи с возможностью продавать с любого склада. Помощь в эффективном планировании ассортимента собственного склада. Регулярные выкуп и замена остатков, сохраняющие прибыль. Простота входа в сеть, открытие магазина Франчайзором «под ключ». Высокие объемы продаж, в том числе за счет вытеснения мелких конкурентов с рынка. Низкие расходы на эквайринг за счет большого оборота всей сети. Возможность дополнительных доходов на услугах.']
      },
       {
        title: "Требования к франчайзи",
        text: [
            'Успешный опыт в бизнесе.',
            'Ответственный и порядочный подход к ведению бизнеса.',
            'Нацеленность на взаимовыгодное сотрудничество.',
            'Готовность к соблюдению стандартов работы по франшизе.',
            'Наличие необходимой суммы инвестиций.'
        ]
      },
      {
        title: "Контакты",
        text: [
            'Для получения анкеты партнера обращайтесь:',
            '+998 99 3941226',
            'shuxratbekzokirjonov1119@gmail.com'
        ]
      }
   ]
})
onMounted(() => {
    window.scrollTo({top: 0, behavior: 'smooth'})
})
</script>

<style scoped>

</style>