<template>
    <v-container class="flex flex-col items-center">
        <div class="payment_top xx:w-full xl:w-7/12 md:w-7/12"
        v-for="(item,index) in paymentsInfo"
        :key="index">
            <h1 class="font-bold text-xl">{{item.title}}</h1>
            <span class="inline-block py-6 text-sm text-gray-700">{{item.text}}</span>
        </div>
        <div class="payment_footer xx:flex-col xl:flex-row md:flex-row flex my-10">
             <div class="payment_btn xx:mb-4 xl:mb-0 md:mb-0 xx:flex xx:flex-row md:flex-col xx:w-full xl:w-2/12 md:w-2/12 xl:mr-10 md:mr-10">
                <div class="cursor-pointer text-sm xl:mb-4 md:mb-4"
                 @click="shows = false">
                    Возврат дисков 
                    <span v-if="shows == false" class="mdi mdi-chevron-right-circle-outline"></span>
                </div>
                <div class="cursor-pointer text-sm xl:mt-4 md:mt-4 xx:ml-6"
                @click="shows = true">
                    Возврат шин
                    <span v-if="shows" class="mdi mdi-chevron-right-circle-outline"></span>
                </div>
             </div>
             <div class="disk_list xl:w-7/12 md:w-7/12" v-if="shows == false">
                <h1 class="mb-5 font-bold text-xl font-sans">{{DiskReturn.title}}</h1>
                <div class="list_item my-5" v-for="(item,index) in DiskReturn.lists" :key="index">
                     <h1 class="text-sm mb-5">{{item.title}}</h1>
                     <ol class="item text-sm my-2" v-for="(x,index) in item.disk" :key="index">
                         <li>
                            <span class="mdi mdi-check-circle-outline mr-3"></span>
                            <span>{{x}}</span>
                        </li>
                     </ol>
                </div>
                <div class="text_1 w-full my-5 text-sm font-sans text-gray-700">
                    {{DiskReturn.footer_text}}
                </div>
                <div class="text_1 w-full my-5 text-sm font-sans text-gray-700">
                    {{DiskReturn.footer_texts}}
                </div>
             </div>
             <div class="shina_list xl:w-7/12 md:w-7/12" v-else>
                <h1 class="text-xl font-bold mb-5">{{shinaReturn.title}}</h1>
                <div class="text text-sm font-sans text-gray-700">
                    {{shinaReturn.text}}
                </div>
             </div>
        </div>
    </v-container>
</template>

<script setup>
import {ref} from "vue"
const shows = ref(false)
const paymentsInfo = ref([
    {
        title: "Рассрочка",
        text: "Предлагаем приобрести товар в рассрочку от банка ОТП Банк. Рассрочка оформляется на 6 месяцев. Без первоначального взноса и без переплаты. Необходимый возраст заемщика от 21 до 65 лет. Сумма рассрочки от 2 000 до 300 000 руб."
    },
    {
        title: "Система быстрых платежей (QR-Код)",
        text: "Платежи по QR-коду через СБП максимально удобны для онлайн-оплаты покупок, они быстрее классических карточных платежей. Так, на сайте «Сибирь Колесо» покупателю достаточно выбрать способ оплаты через СБП. После того, как на экране будет сформировал QR-код, отсканировать его смартфоном через мобильное приложение своего банка и завершить уже в нем операцию. Подчеркиваем, банк плательщика должен быть участником СБП, а также поддерживать в собственном мобильном приложении оплату по QR-кодам. Деньги со счета будут перечислены мгновенно после совершения оплаты."
    },
    {
        title: "Безопасность онлайн платежей",
        text: "Оплата происходит через авторизационный сервер Процессингового центра Банка с использованием Банковских кредитных карт следующих платежных систем: VISA International, MasterCard World Wide. Для оплаты покупки Вы будете перенаправлены на платежный шлюз ОАО 'Сбербанк России' для ввода реквизитов Вашей карты. Пожалуйста, приготовьте Вашу пластиковую карту заранее. Соединение с платежным шлюзом и передача информации осуществляется в защищенном режиме с использованием протокола шифрования SSL. В случае если Ваш банк поддерживает технологию безопасного проведения интернет-платежей Verified By Visa или MasterCard Secure Code для проведения платежа также может потребоваться ввод специального пароля. Способы и возможность получения паролей для совершения интернет-платежей Вы можете уточнить в банке, выпустившем карту. Настоящий сайт поддерживает 128-битное шифрование. Конфиденциальность сообщаемой персональной информации обеспечивается ОАО 'Сбербанк России'. Введенная информация не будет предоставлена третьим лицам за исключением случаев, предусмотренных законодательством РФ. Проведение платежей по банковским картам осуществляется в строгом соответствии с требованиями платежных систем Visa Int. и MasterCard Europe Sprl.Политика обработки персональных данных"
    }
])
const DiskReturn = ref({
    title: "Возврат дисков",
    lists:[
    {
       title: "Перед монтажом шин на диск (в течении 2-х недель после покупки) обязательно примерьте диск на автомобиль. Убедитесь, что диск ни за что не задевает (тормозной механизм, стойки подвески и т.д.).",
       disk:[
        'Проверьте, что диск точно центруется (без люфта) на ступице автомобиля.',
        'Проверьте (если на автомобиле болты) чтобы они не были слишком длинные, дабы предотвратить повреждение ручного тормоза и датчиков ABS.',
        'Проверьте, что ступичные колпачки не выбивают заглушку диска, а крепеж не препятствует закрыванию крышки.'
       ]
    },
    {
       title: "Во избежание потери колес на ходу:",
       disk:[
        'Проверьте, крепеж должен соответствовать посадочным отверстиям на диске (сфера, конус или шайба).',
        'Проверьте, колесные болты или гайки должны закручиваться минимум на пять витков резьбы.',
        'Проверьте что все 4 диска одного цвета, одинаковой сверловки, одинакового диаметра и ширины.'
       ]
    }
    ],
    footer_text: "Необходимо устанавливать диски как на переднюю, так и на заднюю ось. Возврат возможен только в товарном виде при сохранении заводской упаковки. Данные правила не служат для ущемления прав покупателей, а наоборот, служат для предотвращения спорных и конфликтных ситуаций. Например, если факт несоответствия колес автомобилю выяснится после проведения шиномонтажных работ на стороннем сервисе, Вам придется оплатить их стоимость, а потом заплатить за обратную переобувку.",
    footer_texts:"Просим отнестись с пониманием к таким фактам, что диски универсальные, а не оригинальные, производитель оставляет за собой право замены сферы болта (гайки) на конус, и наоборот. Ни один даже самый полный каталог не содержит такой информации, как кривизна внутренней формы диска и его совместимость с тормозными механизмами, особенно на тюнинговых моделях а/м."
})
const shinaReturn = ref({
    title: "Возврат шин",
    text: "Автомобильные шины подлежат возврату и обмену в течении 2-х недель после покупки. Автомобильные шины должны иметь товарный вид. Автомобильные шины не должны иметь следы от монтажа на колесный диск, т.е не должны быть монтированы. Автомобильные шины не должны иметь следов механических повреждений."
})
</script>

<style lang="scss" scoped>

</style>