<template>
    <v-container>
       <div class="info_top">
          <div class="items xl:w-8/12 xl:ml-52 md:w-8/12 md:ml-52"
          v-for="(item,index) in informations"
          :key="index">
              <h1 class="font-bold text-xl">{{item.title}}</h1>
              <p v-if="item.text" class="text-sm py-5 text-gray-700">
                {{item.text}}
              </p>
              <ol class="ml-5 my-5">
                <li 
                v-for="(x,index) in item.lists"
                :key="index"
                class="text-sm"
                :class="[item.text ? 'my-4' : 'my-0']"
                >
                  <span v-if="item.text" class="list-inside mr-2 mdi mdi-check-circle-outline"></span> {{x}}
                </li>
              </ol>
          </div>
       </div>
       <div class="remont_list xx:flex-col xl:flex-row md:flex-row flex flex-wrap justify-between">
          <div 
          class="items border-0.1 rounded p-10 my-3"
          v-for="(item,index) in informationBoxs"
          :key="index"
          :class="[index == 0 ? 'xl:w-full md:w-full' : 'xl:w-106 md:w-106']"
          >
             <h1 class="font-bold text-xl">
                {{item.title}}
             </h1>
             <ul class="my-5">
                <li 
                  v-for="(list,index) in item.lists"
                  :key="index"
                  class="text-sm font-sans text-gray-700"
                  >
                    {{list}}
                </li>
             </ul>
          </div>
       </div>
       <div class="footer_list my-5">
          <div class="items xl:w-8/12 xl:ml-52 md:ml-52 md:w-8/12"
          v-for="(item,index) in footeerList"
          :key="index">
              <h1 class="font-bold text-xl w-72">{{item.title}}</h1>
              <span class="text-xs text-gray-600">
                {{item.title_bottom}}
              </span>
              <p v-if="item.text" class="text-sm py-5 text-gray-700">
                {{item.text}}
              </p>
              <ol class="ml-5 my-5">
                <li 
                v-for="(x,index) in item.lists"
                :key="index"
                class="text-sm my-4"
                >
                  <span v-if="item.text" class="list-inside mr-2 mdi mdi-check-circle-outline"></span> {{x}}
                </li>
              </ol>
              <div class="end_text text-sm text-gray-700">
                  {{item.end_text}}
              </div>
          </div>
       </div>
    </v-container>
</template>

<script setup>
import {ref} from "vue"
const informations = ref([
    {
        title: "Правка дисков",
        text: "Не отчаивайтесь! Мы поможем восстановить его. Правка дисков может понадобиться каждому автовладельцу, ведь никто не застрахован от повреждения даже новых колес. Правка дисков поможет исправить ситуацию и продолжить эксплуатировать автомобиль в нормальном режиме. В этом вам поможет команда «Сибирь-Колесо». Мы обладаем опытом и знаниями, а также самым современным оборудованием, чтобы исправить все повреждения.",
        lists:[
            'Проката стальных (штамповка) дисков: от 400 р. за диск.',
            'Правка литых дисков: от 800 р. за диск (в зависимости от сложности)',
            'Сварка аргоном: 150 р. за 1 сантиметр.'
        ]
    },
    {
        title: "Ремонт шин и дисков",
        lists: [
            'Всегда для вас услуги по ремонту шин и дисков по адресам:',
            'г. Новосибирск, ул. Петухова 35, корпус 8.',
            'г. Новосибирск, ул. Механизаторов 72.'
        ]
    }
])
const informationBoxs = ref([
    {
        title: "Ремонт шин",
        lists: [
            'Заплатка камерная: 150 р.',
            'Заплатка кордовая усиленная: от 350 р.',
            'Жгут: 100 р.',
            'Ремонт боковых порезов: от 800 р.',
            'Дошиповка: 15 р. / 1 шт.'
        ]
    },
    {
        title: "Диски (штамповка)",
        lists: [
            'Прокатка R12–14: от 400 р',
            'Прокатка R15: от 500 р.',
            'Прокатка R16: от 600 р.',
            'Прокатка R17: от 800 р.',
            'Прокатка R18: от 1000 р.',
            'Прокатка R16 (газель): от 800 р.'
        ]
    },
    {
        title: 'Литые или кованные диски',
        lists:[
            'Правка R13–15: от 800 р.',
            'Правка R16–17: от 1000 р.',
            'Правка R18–20: от 1200 р.',
            'Правка R21–22: от 1400 р.',
            'правка R23–24: от 1600 р.',
            'Сварка аргоном: от 150 р. / 1 см.',
            'Наварка недостающего элемента диска: от 1500 р.'
        ]
    }
])
const footeerList = ref([
    {
        title: "Сезонное хранение",
        title_bottom: "(временно не предоставляется)",
        text: "Наша компания оказывает услуги по сезонному хранению ваших шин и колес. Если у вас имеется несколько комплектов автомобильных колес или шин. Это может создать серьезную проблему по их хранению. При хранении автомобильной резины, для ее продолжительного использования, просто необходимо соблюдать определенные условия и правила хранения, чтобы не нанести вред резине, рекомендуем:",
        lists: [
            'Держать шины в прохладном, сухом месте, защищенном от прямых солнечных лучей.',
            'Так же не допускается держать вблизи колес химикаты, жиры, бензин, различные реагенты. Эти вещества способны разрушить резину, они в состоянии существенно сократить срок ее эксплуатации.',
            'Складывать на зиму или на лето колеса лучше на специальные деревянные поддоны. Если шины без дисков, следует избегать постоянного давления на одну область, для этого шины необходимо время от времени вращать. Ни в коем случае не храните колеса вертикально!'
        ],
        end_text: "Есть другие нюансы, играющие немаловажную роль в хранении шин: Имейте в виду, что каждый раз, когда вы оставляете их на балконе или в гараже, они подвергаются вредному воздействию, что существенно сокращает срок их службы. Беречь «обувь» вашей машины, нужно также бережно, как и свою собственную. И тогда она будет радовать вас на протяжении длительного времени, это в свою очередь положительно отразится на ваших финансах."
    }
])
</script>

<style lang="scss" scoped>

</style>