<template>
    <div class="Credit">
       <div class="menu">
        <Menu/>
       </div>
       <div class="content py-5 border-b-0.1">
          <About :aboutInfo="aboutInfo">
             <template v-slot:contact>
               <span></span>
             </template>
             <template v-slot:text>
               <span></span>
             </template>
             <template v-slot:infoText>
                 <div class="credit_text xl:w-7/12 md:w-7/12 font-inter xl:mt-20 xx:mt-10 text-sm">
                     {{aboutInfo.credit}}
                 </div>
             </template>
          </About>
       </div>
       <div class="credit_change h-auto">
            <Credit :CreditList="CreditList">
            </Credit>
       </div>
       <div class="footer bg-zinc-900 xl:h-89 md:h-89 flex flex-col justify-center">
           <Footer />
       </div>
    </div>
</template>

<script setup>
import Menu from "@/components/MenuBar.vue"
import Footer from "@/components/footer.vue"
import About from "@/components/about.vue"
import Credit from "@/components/credit.vue"
import {ref} from "vue"
const number = ref({
    num: 1,
    style: "w-1/2 h-1/2 block object-cover"
})
const aboutInfo = ref({
   footer_text: "",
   title: "Доставка",
   footers: [],
   credit: "Мы всегда рады предложить самые удобные способы доставки для наших клиентов. Если вы не нашли удобный для вас способ доставки — вы всегда можете связаться с нашими менеджерами по телефону: +998 99 394 12 26 (звонок бесплатный) и обсудить любые иные варианты доставки вашего заказа."
})
const CreditList = ref([
    {
        icon: "https://sibirkoleso.ru/upload/logos/delivery4.svg",
        term: [
            'Сроки: от 2 до 72 часов',
             'Стоимость: Бесплатно.'
        ],
        title: "Постаматы TyreBox",
        info:[
            {
            petition:[
            'Оформите заказ на сайте и выберите способ доставки через постамат TyreBox. После того как менеджер подтвердит наличие товара, статус заказа изменится на «На складе», и вы сможете оплатить его онлайн. После оплаты ваш заказ будет доставлен в выбранный постамат TyreBox, и вы получите уведомление о готовности к получению. Вы сможете забрать свой заказ в любое удобное для вас время. Открытие ячейки осуществляется через личный кабинет на сайте',
            'В случае возврата товара его можно вернуть в любом розничном магазине Сибирь-Колесо.TyreBox - для вашего удобства и комфорта!'
            ]
            }
        
        ]
    },
    {
        icon: "https://sibirkoleso.ru/upload/logos/delivery1.svg",
        title: "Доставка по городу",
        term:[
            'Сроки: от 2 до 72 часов (кроме воскресенья).',
            'Стоимость при заказе от 4 шт: Бесплатно (менее 4 шт., стоимость доставки 200 руб)'
        ],
        info:[
            {
                petition:[
                    'В день доставки с вами предварительно свяжутся по телефону указанному в заказе. Доставка осуществляется курьерской машиной, как правило, на следующий день после заказа. Товар оплачивается наличными, либо пластиковой картой при получении. В случае отказа, вы оплачиваете сумму за использование транспорта — 200 руб.',
                    'Мы доставляем товар до подъезда, водитель-экспедитор не имеет права отдаляться от машины, так как несет ответственность за груз и автомобиль, по этой причине он не заносит товар внутрь вашего помещения. Наши водители-экспедиторы заинтересованы в том, чтобы доставить ваш товар как можно ближе к зданию. Однако, иногда, в силу некоторых причин (ремонтно-дорожные работы, ограничения остановки и движения дорожными знаками), не позволяют этого сделать.',
                    'Районы: Пашино, Кольцово, Мочище, Марусино, г. Обь: 300 руб.Бердск, Верх-Тула, Раздольное, Морозово: 500 руб.Грузовые автошины: 200 руб за 1 шт.'                ],
            }
        ]
    },
    {
        icon: "https://sibirkoleso.ru/upload/logos/delivery2.svg",
        title: "Самовывоз со склада",
        term: [
            'Самовывоз заказанного товара осуществляется с пунктов выдачи только в рабочее время.',
            'По всем вопросам, обращайтесь по телефону, непосредственно в ваш пункт выдачи заказа.'
        ],
        info:[
            {
                petition:[
                  'Срок доставки товара в пункт выдачи от мгновенного (товар в наличии) до 3-х рабочих дней. Информацию о сроках доставки можно получить непосредственно в пункте выдачи по телефону. По приходу товара на склад с вами свяжется менеджер (телефон, электронная почта). Так же, на пунктах выдачи вы можете воспользоваться услугами шиномонтажа и сезонного хранения.',
                  'Пункты выдачи'
                ]
            }
        ]
    },
    {
        icon: "https://sibirkoleso.ru/upload/logos/delivery3.svg",
        title: "Транспортные компании",
        term: [
            'Доставка по России и другим странам осуществляется с помощью сторонних транспортных компаний. Выбор транспортной компании осуществляется покупателем самостоятельно. В случае отказа покупателя от товара продавец удерживает из стоимости товара свои транспортные расходы, связанные с доставкой. Стоимость и сроки зависят от выбранной транспортной компании.'
        ],
        info:[
            {
                petition:[
                  'Срок доставки товара в пункт выдачи от мгновенного (товар в наличии) до 3-х рабочих дней. Информацию о сроках доставки можно получить непосредственно в пункте выдачи по телефону. По приходу товара на склад с вами свяжется менеджер (телефон, электронная почта). Так же, на пунктах выдачи вы можете воспользоваться услугами шиномонтажа и сезонного хранения.',
                  'Пункты выдачи'
                ]
            }
        ]
    }
])

</script>

<style scoped>

</style>